{
  "Ageratum conyzoides": {
    "common_name": "Billygoat Weed",
    "description": "A fast-growing invasive weed known for its blue-purple flowers. It competes with crops and can alter ecosystems."
  },
  "Artemisia vulgaris": {
    "common_name": "Mugwort",
    "description": "Commonly known as mugwort, this aromatic plant can rapidly spread and displace native vegetation."
  },
  "Asparagus officinalis": {
    "common_name": "Asparagus",
    "description": "A cultivated vegetable that can escape into the wild and grow aggressively, forming dense stands."
  },
  "Bidens pilosa": {
    "common_name": "Hairy Beggarticks",
    "description": "Also called Spanish needle, this weed spreads rapidly and is difficult to eradicate once established."
  },
  "Cardiospermum halicacabum": {
    "common_name": "Balloon Vine",
    "description": "Known as balloon vine, this fast-growing climber can smother native plants and spread along fences and trees."
  },
  "Chloris barbata": {
    "common_name": "Swollen fingergrass",
    "description": "An invasive grass species that competes with native grasses and alters the natural habitat structure."
  },
  "Chromolaena odorata": {
    "common_name": "Siam weed",
    "description": "A major invasive shrub known as Siam weed; it forms dense thickets that suppress native flora."
  },
  "Heliotropium indicum": {
    "common_name": "Indian Turnsole",
    "description": "Commonly found in disturbed areas, this weed produces allelopathic compounds harmful to nearby plants."
  },
  "Imperata cylindrica": {
    "common_name": "Cogongrass",
    "description": "One of the world’s worst invasive grasses; forms dense mats and spreads rapidly through rhizomes."
  },
  "Lantana camara": {
    "common_name": "Lantana",
    "description": "A notorious invasive shrub with colorful flowers; toxic to livestock and forms dense, impenetrable thickets."
  },
  "Leucaena leucocephala": {
    "common_name": "Ipil-ipil",
    "description": "A fast-growing tree used for fodder and erosion control, but invades forests and grasslands."
  },
  "Melia azedarach": {
    "common_name": "Chinaberry tree",
    "description": "Also known as Chinaberry, this tree spreads aggressively and displaces native species."
  },
  "Mikania micrantha": {
    "common_name": "American Rope",
    "description": "A highly invasive vine that climbs and chokes other vegetation; known as 'mile-a-minute' weed."
  },
  "Mimosa pudica": {
    "common_name": "Siam weed",
    "description": "Famous for its touch-sensitive leaves, this plant can spread aggressively in disturbed soils."
  },
  "Mirabilis jalapa": {
    "common_name": "Four-o-clock",
    "description": "Also called four o’clock flower; a garden escapee that naturalizes and spreads rapidly."
  },
  "Muntingia calabura": {
    "common_name": "Jamaican Cherry",
    "description": "A fast-growing tree with sweet fruits; spreads easily via birds and disrupts native plant regeneration."
  },
  "Passiflora foetida": {
    "common_name": "Stinking passion flower",
    "description": "An invasive passionfruit vine with sticky fruits; smothers small plants and hedges."
  },
  "Pistia stratiotes": {
    "common_name": "Water lettuce",
    "description": "Commonly known as water lettuce; a floating aquatic weed that blocks sunlight and reduces oxygen in water."
  },
  "Portulaca pilosa": {
    "common_name": "Pigweed",
    "description": "A succulent groundcover that spreads easily in dry areas, often outcompeting native species."
  },
  "Punica granatum": {
    "common_name": "Pomegranate",
    "description": "Known as pomegranate, it may become invasive in some tropical areas if not managed."
  },
  "Raphanus sativus": {
    "common_name": "Radish",
    "description": "Wild radish; can naturalize quickly and compete with native vegetation in disturbed soils."
  },
  "Sonchus oleraceus": {
    "common_name": "Common sowthistle",
    "description": "A fast-spreading annual herb that competes with crops and is hard to control once established."
  }
}
